// Generated by jextract

package me.eigenraven.sdl2panama;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$177 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$177() {}
    static final VarHandle const$0 = constants$175.const$2.varHandle(MemoryLayout.PathElement.groupElement("attack_length"));
    static final VarHandle const$1 = constants$175.const$2.varHandle(MemoryLayout.PathElement.groupElement("attack_level"));
    static final VarHandle const$2 = constants$175.const$2.varHandle(MemoryLayout.PathElement.groupElement("fade_length"));
    static final VarHandle const$3 = constants$175.const$2.varHandle(MemoryLayout.PathElement.groupElement("fade_level"));
    static final UnionLayout const$4 = MemoryLayout.unionLayout(
        JAVA_SHORT.withName("type"),
        MemoryLayout.structLayout(
            JAVA_SHORT.withName("type"),
            MemoryLayout.paddingLayout(16),
            MemoryLayout.structLayout(
                JAVA_BYTE.withName("type"),
                MemoryLayout.paddingLayout(24),
                MemoryLayout.sequenceLayout(3, JAVA_INT).withName("dir")
            ).withName("direction"),
            JAVA_INT.withName("length"),
            JAVA_SHORT.withName("delay"),
            JAVA_SHORT.withName("button"),
            JAVA_SHORT.withName("interval"),
            JAVA_SHORT.withName("level"),
            JAVA_SHORT.withName("attack_length"),
            JAVA_SHORT.withName("attack_level"),
            JAVA_SHORT.withName("fade_length"),
            JAVA_SHORT.withName("fade_level")
        ).withName("constant"),
        MemoryLayout.structLayout(
            JAVA_SHORT.withName("type"),
            MemoryLayout.paddingLayout(16),
            MemoryLayout.structLayout(
                JAVA_BYTE.withName("type"),
                MemoryLayout.paddingLayout(24),
                MemoryLayout.sequenceLayout(3, JAVA_INT).withName("dir")
            ).withName("direction"),
            JAVA_INT.withName("length"),
            JAVA_SHORT.withName("delay"),
            JAVA_SHORT.withName("button"),
            JAVA_SHORT.withName("interval"),
            JAVA_SHORT.withName("period"),
            JAVA_SHORT.withName("magnitude"),
            JAVA_SHORT.withName("offset"),
            JAVA_SHORT.withName("phase"),
            JAVA_SHORT.withName("attack_length"),
            JAVA_SHORT.withName("attack_level"),
            JAVA_SHORT.withName("fade_length"),
            JAVA_SHORT.withName("fade_level"),
            MemoryLayout.paddingLayout(16)
        ).withName("periodic"),
        MemoryLayout.structLayout(
            JAVA_SHORT.withName("type"),
            MemoryLayout.paddingLayout(16),
            MemoryLayout.structLayout(
                JAVA_BYTE.withName("type"),
                MemoryLayout.paddingLayout(24),
                MemoryLayout.sequenceLayout(3, JAVA_INT).withName("dir")
            ).withName("direction"),
            JAVA_INT.withName("length"),
            JAVA_SHORT.withName("delay"),
            JAVA_SHORT.withName("button"),
            JAVA_SHORT.withName("interval"),
            MemoryLayout.sequenceLayout(3, JAVA_SHORT).withName("right_sat"),
            MemoryLayout.sequenceLayout(3, JAVA_SHORT).withName("left_sat"),
            MemoryLayout.sequenceLayout(3, JAVA_SHORT).withName("right_coeff"),
            MemoryLayout.sequenceLayout(3, JAVA_SHORT).withName("left_coeff"),
            MemoryLayout.sequenceLayout(3, JAVA_SHORT).withName("deadband"),
            MemoryLayout.sequenceLayout(3, JAVA_SHORT).withName("center"),
            MemoryLayout.paddingLayout(16)
        ).withName("condition"),
        MemoryLayout.structLayout(
            JAVA_SHORT.withName("type"),
            MemoryLayout.paddingLayout(16),
            MemoryLayout.structLayout(
                JAVA_BYTE.withName("type"),
                MemoryLayout.paddingLayout(24),
                MemoryLayout.sequenceLayout(3, JAVA_INT).withName("dir")
            ).withName("direction"),
            JAVA_INT.withName("length"),
            JAVA_SHORT.withName("delay"),
            JAVA_SHORT.withName("button"),
            JAVA_SHORT.withName("interval"),
            JAVA_SHORT.withName("start"),
            JAVA_SHORT.withName("end"),
            JAVA_SHORT.withName("attack_length"),
            JAVA_SHORT.withName("attack_level"),
            JAVA_SHORT.withName("fade_length"),
            JAVA_SHORT.withName("fade_level"),
            MemoryLayout.paddingLayout(16)
        ).withName("ramp"),
        MemoryLayout.structLayout(
            JAVA_SHORT.withName("type"),
            MemoryLayout.paddingLayout(16),
            JAVA_INT.withName("length"),
            JAVA_SHORT.withName("large_magnitude"),
            JAVA_SHORT.withName("small_magnitude")
        ).withName("leftright"),
        MemoryLayout.structLayout(
            JAVA_SHORT.withName("type"),
            MemoryLayout.paddingLayout(16),
            MemoryLayout.structLayout(
                JAVA_BYTE.withName("type"),
                MemoryLayout.paddingLayout(24),
                MemoryLayout.sequenceLayout(3, JAVA_INT).withName("dir")
            ).withName("direction"),
            JAVA_INT.withName("length"),
            JAVA_SHORT.withName("delay"),
            JAVA_SHORT.withName("button"),
            JAVA_SHORT.withName("interval"),
            JAVA_BYTE.withName("channels"),
            MemoryLayout.paddingLayout(8),
            JAVA_SHORT.withName("period"),
            JAVA_SHORT.withName("samples"),
            MemoryLayout.paddingLayout(32),
            RuntimeHelper.POINTER.withName("data"),
            JAVA_SHORT.withName("attack_length"),
            JAVA_SHORT.withName("attack_level"),
            JAVA_SHORT.withName("fade_length"),
            JAVA_SHORT.withName("fade_level")
        ).withName("custom"),
        MemoryLayout.paddingLayout(576)
    ).withName("SDL_HapticEffect");
    static final VarHandle const$5 = constants$177.const$4.varHandle(MemoryLayout.PathElement.groupElement("type"));
}


